{
  "backend/main.mo": "Motoko actor implementing access control, task and profile data types, and admin-only APIs for managing assignee–captain pairs.",
  "feature_evidence.json": "Feature evidence report linking a modal‑size update to the TaskDetailDialog file with metadata, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their purpose, functionality, and roles in the app.",
  "frontend/index.css": "Tailwind setup defining light and dark theme CSS variables and base styling for the app.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component with tabbed navigation, theming, error boundaries, and bootstrap-driven user/admin routing.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Login‑required screen prompting unauthenticated users to authenticate via Internet Identity.",
  "frontend/src/components/AdminTaskDialog.tsx": "Admin dialog for creating tasks with category, status, payment, and automated assignee–captain selection.",
  "frontend/src/components/AppBootstrap.tsx": "Initialization wrapper handling identity, actor setup, profile/admin queries, error states, and profile setup flow.",
  "frontend/src/components/AppLoadErrorScreen.tsx": "Displays a user-friendly app load error with reload and optional retry actions.",
  "frontend/src/components/AssigneeDetailsTab.tsx": "Shows and edits an assignee/captain pair with save and delete controls.",
  "frontend/src/components/AssigneeDirectoryManagement.tsx": "Manages a directory of assignee/captain pairs with create, edit, delete, bulk upload, and tabbed detail views.",
  "frontend/src/components/BulkUploadSection.tsx": "Handles CSV/Excel upload for bulk task creation, including parsing and validation.",
  "frontend/src/components/CategoryManagement.tsx": "Manages task categories, subcategories, statuses, and payment statuses with creation forms.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and external link.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, theme toggle, and user menu including logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects name and email and saves the user profile via mutation.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary that logs runtime errors and shows a fallback error screen.",
  "frontend/src/components/TaskDetailDialog.tsx": "Dialog showing task list and dynamic tabs for viewing and editing individual tasks.",
  "frontend/src/components/TaskDetailsTab.tsx": "Tab displaying detailed information about a task with optional admin editing.",
  "frontend/src/components/TaskFormDialog.tsx": "Form dialog for creating or updating tasks with category, status, and assignment fields.",
  "frontend/src/components/UserManagement.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, admin checks, tasks, and task filters with error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Wraps useActor with timeout, error tracking, and refetch logic to ensure reliable actor initialization.",
  "frontend/src/hooks/useTaskDetailTabs.ts": "Manages task detail tabs, including opening, closing, updating, and resetting active tabs.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/AdminPage.tsx": "Renders admin panel tabs for bulk upload, category settings, and assignee directory management.",
  "frontend/src/pages/Dashboard.tsx": "Displays task analytics dashboards and supports filtering tasks by category, status, and payment status.",
  "frontend/src/pages/TasksPage.tsx": "Shows a searchable, filterable task table with CRUD actions and multi‑tab task detail management.",
  "frontend/src/utils/assigneeCsv.ts": "Generates CSV templates and parses assignee/captain CSV files with validation and error reporting.",
  "frontend/src/utils/diagnostics.ts": "Provides safe logging utilities that redact sensitive data and report initialization or runtime errors.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with session persistence and hash-route support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes current project state, requirements, known issues, and planned features for task assignment without user accounts."
}