{
  "backend/main.mo": "Defines task, user, and category types, initializes access control and storage mixins, and implements admin‑restricted APIs for managing assignee/captain pairs.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files and related components for bulk upload and ownership‑handling changes.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for major frontend files including components, pages, and utilities.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component wiring theme, error boundaries, and tabbed navigation for dashboard, tasks, and admin pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Login gate screen prompting unauthenticated users to sign in via Internet Identity.",
  "frontend/src/components/AdminTaskDialog.tsx": "Admin dialog for creating tasks with full field set, validation, and data loading for categories, statuses, and assignee directory.",
  "frontend/src/components/AppBootstrap.tsx": "Initializes authenticated app state, handling identity, actor creation, profile/admin queries, and showing loading, error, or setup screens before rendering children.",
  "frontend/src/components/AppLoadErrorScreen.tsx": "Displays a user-friendly error screen with reload and optional retry actions when the app fails to load.",
  "frontend/src/components/AssigneeDetailsTab.tsx": "Provides a UI to view, edit, or delete a single assignee–captain pair with confirmation dialogs and mutation hooks.",
  "frontend/src/components/AssigneeDirectoryManagement.tsx": "Manages the full assignee–captain directory with add, edit, delete, bulk CSV import, and detailed per-assignee tabs.",
  "frontend/src/components/BulkUploadSection.tsx": "Handles bulk task creation via CSV/Excel upload with parsing, validation, and submission to backend.",
  "frontend/src/components/CategoryManagement.tsx": "Allows creation and listing of task categories, subcategories, statuses, and payment statuses using backend mutation hooks.",
  "frontend/src/components/Footer.tsx": "Renders a simple site footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Provides the app header with branding, theme toggle, user avatar menu, and logout handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal for collecting and saving initial user profile information.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Catches runtime React errors and shows a fallback error screen while logging diagnostics.",
  "frontend/src/components/TaskDetailDialog.tsx": "Renders a dialog with task list and task detail tabs, supporting editing and tab management.",
  "frontend/src/components/TaskDetailsTab.tsx": "Shows detailed task information with formatted fields and an edit option for admins.",
  "frontend/src/components/TaskFormDialog.tsx": "Form dialog for creating or updating tasks, including field population, validation, and submission.",
  "frontend/src/components/UserManagement.tsx": "Empty placeholder file for user management functionality.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, managing identity loading, login state, and error handling using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend tasks and user data, including fetch, mutate, filtering, and error parsing helpers.",
  "frontend/src/hooks/useSafeActor.ts": "Wraps useActor with timeout, error handling, and retry support to ensure reliable backend actor initialization.",
  "frontend/src/hooks/useTaskDetailTabs.ts": "Manages tab state for viewing multiple task detail panels, including opening, closing, updating, and resetting tabs.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, including color tokens and layout defaults.",
  "frontend/src/main.tsx": "Initializes the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with tabs for bulk upload, category settings, and assignee management.",
  "frontend/src/pages/Dashboard.tsx": "Displays charts and task statistics with filters, enabling drill-down into tasks by category, status, or payment status.",
  "frontend/src/pages/TasksPage.tsx": "Shows a searchable, filterable task list with create, edit, delete, and tabbed task detail viewing functionality.",
  "frontend/src/utils/assigneeCsv.ts": "Provides helpers to generate, download, and parse assignee/captain CSV files with basic validation and quoted-value parsing.",
  "frontend/src/utils/diagnostics.ts": "Implements redacted diagnostic logging for initialization and runtime errors, including step-based init logs.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading, persisting, and clearing URL parameters across normal and hash-based routing using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animation.",
  "project_state.json": "Tracks project version, requirements, issues, and architectural notes for a task assignment app using assignee and captain names."
}