{
  "backend/main.mo": "Primary canister logic defining task, category, status, and assignee/captain data structures with access‑controlled CRUD for assignee–captain pairs.",
  "backend/migration.mo": "Migration utility converting old actor state to the new format by adding an empty assignee–captain directory.",
  "feature_evidence.json": "Feature evidence report mapping new UI and API work to specific frontend files and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all major frontend components and pages.",
  "frontend/index.css": "Tailwind base and design‑token definitions providing a custom OKLCH color system for light and dark themes.",
  "frontend/index.html": "Main HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level app managing authentication, profile setup, admin detection, and tabbed navigation.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Login‑prompt screen shown to unauthenticated users using Internet Identity.",
  "frontend/src/components/AdminTaskDialog.tsx": "Modal form for admins to create tasks, handling validation, category/subcategory selection, and auto-filling assignee/captain from a directory.",
  "frontend/src/components/AssigneeDirectoryManagement.tsx": "Interface to add, edit, and delete assignee–captain pairs, displaying them in a table with edit and delete actions.",
  "frontend/src/components/BulkUploadSection.tsx": "Handles CSV/Excel file upload, parses task rows, validates headers, and triggers bulk task creation.",
  "frontend/src/components/CategoryManagement.tsx": "UI for creating and listing task categories, subcategories, statuses, and payment statuses.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying a copyright message and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header showing branding, theme toggle, and a user dropdown with profile info and logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter name and email, saving the profile before allowing app use.",
  "frontend/src/components/TaskDetailDialog.tsx": "Displays a dialog showing a table of tasks with loading states and admin edit actions.",
  "frontend/src/components/TaskFormDialog.tsx": "Form dialog for creating or editing tasks, handling field population, validation, and submission.",
  "frontend/src/components/UserManagement.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for tasks, user profiles, admin checks, and related mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables for light/dark modes and base styles.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard with tabs for bulk upload, category settings, and assignee directory management.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing task statistics with charts and interactive filters that open a task detail dialog.",
  "frontend/src/pages/TasksPage.tsx": "Tasks list page with search, filtering, task creation/editing, and deletion features for admins and users.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Project state file outlining current features, requirements, and pending requests related to task assignment without user accounts."
}