{
  "backend/main.mo": "Motoko canister defining task, user, and metadata types, access control, storage maps, and admin-only APIs for managing assignee/captain pairs.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file and component.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark theme tokens and foundational styles.",
  "frontend/index.html": "Basic HTML document that loads the React application entrypoint.",
  "frontend/src/App.tsx": "Root React component wiring theme, error boundary, bootstrap, and tabbed navigation for Dashboard, Tasks, and Admin pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen prompting unauthenticated users to log in via Internet Identity.",
  "frontend/src/components/AdminTaskDialog.tsx": "Admin-only task creation dialog with form state, validation, directory integration, and submission logic for all task fields.",
  "frontend/src/components/AppBootstrap.tsx": "Initializes the authenticated app flow, handling identity, actor setup, profile/admin queries, and showing loading or error screens as needed.",
  "frontend/src/components/AppLoadErrorScreen.tsx": "Displays a user-friendly error screen with reload and optional retry actions when the app fails to load.",
  "frontend/src/components/AssigneeDetailsTab.tsx": "Provides a detailed view and edit/delete controls for a specific assignee–captain pair.",
  "frontend/src/components/AssigneeDirectoryManagement.tsx": "Manages the full assignee–captain directory with add, edit, delete, bulk upload, and tabbed detail views.",
  "frontend/src/components/BulkUploadSection.tsx": "Handles CSV/Excel upload and parsing to bulk-create tasks with validation and status feedback.",
  "frontend/src/components/CategoryManagement.tsx": "Manages creation and listing of task categories, subcategories, statuses, and payment statuses.",
  "frontend/src/components/Footer.tsx": "Renders a simple site footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, user avatar menu, and logout handling using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and submit their name and email to create a profile.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Top-level error boundary that logs runtime errors and shows a fallback screen with reload option.",
  "frontend/src/components/TaskDetailDialog.tsx": "Dialog displaying a task list and multi-tab detailed views with edit support for each task.",
  "frontend/src/components/TaskDetailsTab.tsx": "Shows detailed information for a single task with editing available for admins.",
  "frontend/src/components/TaskFormDialog.tsx": "Form dialog for creating or editing tasks, handling categories, statuses, dates, and billing fields.",
  "frontend/src/components/UserManagement.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, managing identity state, login flow, and loading from storage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, tasks, and filtering data through an actor API with error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Wraps useActor with timeout, retry trigger, and error handling to ensure reliable actor initialization.",
  "frontend/src/hooks/useTaskDetailTabs.ts": "Manages UI state for task detail tabs, including opening, closing, updating, and tracking the active tab.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme color variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with tabs for bulk upload, settings, and assignee management.",
  "frontend/src/pages/Dashboard.tsx": "Displays task metrics with charts and enables filtering tasks by category, status, and payment status, showing results in a detail dialog.",
  "frontend/src/pages/TasksPage.tsx": "Lists and filters tasks with search, CRUD actions, and task detail tabs for admins and users.",
  "frontend/src/utils/assigneeCsv.ts": "Generates a CSV template and parses assignee/captain CSV data with validation and simple quoted-value handling.",
  "frontend/src/utils/currency.ts": "Formats bigint or number values into US currency using Intl.NumberFormat.",
  "frontend/src/utils/diagnostics.ts": "Provides redacted diagnostic logging for init steps and runtime errors.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, and plugins.",
  "project_state.json": "Describes project state, requirements, known issues, and architectural notes for the task assignment app."
}