{
  "backend/main.mo": "Defines the main canister with access control, storage mixins, task data models, comparison helpers, and query methods backed by persistent Map structures.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for all major frontend React components and utilities.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML page bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level React app configuring theme, error boundaries, bootstrap, and tabbed navigation for dashboard, tasks, and admin views.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Login-gated screen prompting unauthenticated users to sign in via Internet Identity.",
  "frontend/src/components/AdminTaskDialog.tsx": "Admin-only dialog for creating tasks with full field set, validation, directory lookup, and form state management.",
  "frontend/src/components/AppBootstrap.tsx": "Initializes the authenticated app environment, handling identity, actor setup, profile/admin queries, and displaying appropriate loading or error screens.",
  "frontend/src/components/AppLoadErrorScreen.tsx": "Displays a user-friendly load error screen with retry, reset, and reload options, including reconnecting states.",
  "frontend/src/components/AssigneeDetailsTab.tsx": "Shows and allows editing or deleting of a single assignee/captain pair with form controls and confirmation dialogs.",
  "frontend/src/components/AssigneeDirectoryManagement.tsx": "Manages the full assignee/captain directory with add, edit, delete, bulk operations, CSV import/export, and tabbed details views.",
  "frontend/src/components/BulkActionBar.tsx": "Provides a sticky toolbar for bulk selections with count display, clear button, and optional action controls.",
  "frontend/src/components/BulkEditTasksDialog.tsx": "Offers a dialog to bulk-edit task status and payment status with simple form controls and save handling.",
  "frontend/src/components/BulkUploadSection.tsx": "Handles CSV/Excel upload, parses rows, validates fields, and triggers bulk task creation.",
  "frontend/src/components/CategoryManagement.tsx": "Provides UI to create and list task categories, subcategories, statuses, and payment statuses.",
  "frontend/src/components/Footer.tsx": "Renders a simple branded footer with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, theme toggle, and user account dropdown.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name and email.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Catches runtime errors and shows a fallback screen while logging diagnostics.",
  "frontend/src/components/TaskDetailDialog.tsx": "Shows a dialog with a task list and multi-tab detailed task viewer with editing support.",
  "frontend/src/components/TaskDetailsTab.tsx": "Displays detailed task information with status, payment data, and edit option for admins.",
  "frontend/src/components/TaskFormDialog.tsx": "Dialog component for creating and editing tasks with form fields, validation, and related query hooks.",
  "frontend/src/components/UserManagement.tsx": "Empty file placeholder for user management UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useBulkSelection.ts": "Provides selection logic for lists including toggling items, selecting all, and tracking checkbox state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for tasks, user profiles, admin checks, and task mutations using the backend actor.",
  "frontend/src/hooks/useSafeActor.ts": "Wraps actor creation with timeout handling, reconnection attempts, and fallback logic.",
  "frontend/src/hooks/useTaskDetailTabs.ts": "Manages tab state for opening, updating, and closing task detail tabs.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, variables, themes, and component layers.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AdminPage.tsx": "Renders an admin panel with tabs for bulk upload, category settings, and assignee management.",
  "frontend/src/pages/Dashboard.tsx": "Displays charts and task summaries with filters and a detail dialog for drilling into task groups.",
  "frontend/src/pages/TasksPage.tsx": "Provides task listing with search, filtering, bulk actions, and dialogs for creating, editing, and viewing tasks.",
  "frontend/src/utils/assigneeCsv.ts": "Generates, downloads, and parses assignee CSV files with validation and error collection.",
  "frontend/src/utils/currency.ts": "Formats numeric values as US currency using Intl.NumberFormat.",
  "frontend/src/utils/diagnostics.ts": "Logs initialization and runtime events with sensitive data redacted and supports reconnect diagnostics.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current state, known issues, and features focused on fixing frontend–backend canister ID mismatches."
}