{
  "kind": "build_request",
  "title": "Fix frontend-backend canister ID mismatch causing 'Unable to Load'",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Audit and fix the frontend backend-actor initialization so the production frontend always targets the currently deployed backend canister ID (eliminate stale/mismatched canister IDs and stale generated declarations as causes of the 'Unable to Load' screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-7",
          "recent-messages-8"
        ],
        "quotes": [
          "Do you want me to automatically check the project’s canister IDs and fix any mismatches?",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "After deploying, the app no longer lands on the 'Unable to Load' screen due to actor creation failures when opened in production.",
        "The frontend actor is created successfully and initialization proceeds to profile/admin queries without throwing a canister-routing error (e.g., 'canister not found', 'missing canister', route to wrong canister).",
        "If the project supports a generated declarations import for the backend canister, the frontend is confirmed to be using the latest generated canister ID (not a hardcoded/stale value)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If a user-configurable backend canister override is supported via session/URL parameters (e.g., the existing session key `backendCanisterId`), ensure it is actually respected by actor creation and that the 'Reset Connection Settings' action fully clears it and restores default behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-7",
          "recent-messages-8"
        ],
        "quotes": [
          "that specific \"Unable to Load\" screen means the **frontend still cannot reach the backend canister**",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When `backendCanisterId` is set (URL/hash or sessionStorage), actor creation uses that value; when it is not set, actor creation uses the default deployed canister ID.",
        "Using the existing 'Reset Connection Settings' action clears `backendCanisterId` from sessionStorage (along with other initialization parameters) and reloads cleanly.",
        "The error screen continues to show English-only user-facing text and does not expose secrets (e.g., tokens) in UI."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve connection diagnostics for this failure mode by logging (redacted) connection metadata during actor creation failures to help confirm whether the issue is a canister ID mismatch vs. network/unavailable backend, without exposing sensitive values.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-7"
        ],
        "quotes": [
          "I need to inspect your project files to confirm whether the frontend is pointing to the correct canister ID."
        ]
      },
      "acceptanceCriteria": [
        "On actor creation failure, console diagnostics include a clear, redacted hint about the resolved backend canister target (e.g., 'using default ID' vs 'using override') without printing raw tokens.",
        "No secrets (e.g., `caffeineAdminToken`) appear in console output due to diagnostics logging."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose existing UI components only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor (`backend/main.mo`); only add `backend/migration.mo` if a state upgrade is required (not expected for this fix)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to connectivity (tasks/admin UI changes, bulk operations changes, etc.).",
    "Introducing third-party auth providers or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}