{
  "kind": "build_request",
  "title": "Update Dashboard to show All Tasks, Payment Status insights, and Revenue totals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Update the Dashboard (frontend/src/pages/Dashboard.tsx) so the \"Total Tasks\" summary card is clickable and opens the existing TaskDetailDialog showing all tasks (same behavior as the existing clickable summary cards for Categories/Statuses/Payment Types).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "update dashboard  all task,payment status and total revenur from each task"
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard, clicking the \"Total Tasks\" card opens the TaskDetailDialog.",
        "The dialog title/description clearly indicates it is showing all tasks (English text).",
        "The dialog shows the full list of tasks currently returned by useGetTasks(), and row click still opens the task details tab as it does today."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add revenue reporting to the Dashboard and task list views using existing task financial fields. Specifically: (1) add a new Dashboard KPI card that displays \"Total Revenue\" computed as the sum of task.bill across the currently loaded tasks; and (2) update the Dashboard task list dialog table (frontend/src/components/TaskDetailDialog.tsx) to include a \"Revenue\" (Bill) column per task, formatted as currency.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "update dashboard  all task,payment status and total revenur from each task"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard shows a new KPI card labeled \"Total Revenue\" with the sum of bill across tasks (English text).",
        "If there are no tasks, \"Total Revenue\" displays $0.00 (or equivalent zero currency formatting).",
        "TaskDetailDialog’s task list table includes a \"Revenue\" column populated from task.bill for each row.",
        "Revenue values are displayed in a consistent English/US currency format (e.g., $1,234.00).",
        "No backend API changes are required for the revenue display; values come from the existing Task fields returned by getTasks/filter APIs."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Ensure the Payment Status analytics and drill-down remain intact after the Dashboard updates: the \"Payment Status Distribution\" visualization must still render, and clicking a payment status must still open the TaskDetailDialog pre-filtered to tasks with that payment status.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "update dashboard  all task,payment status and total revenur from each task"
        ]
      },
      "acceptanceCriteria": [
        "Payment Status chart still renders on the Dashboard when payment status data exists.",
        "Clicking any payment status bar/segment still opens the TaskDetailDialog with the correct filtered task list.",
        "If the payment-status filter query fails, the dialog shows an English error description (existing behavior is acceptable)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not change the backend Task schema or introduce new backend analytics endpoints for revenue in this request.",
    "Do not change the existing category/status/payment-status counting logic beyond what is necessary to keep current behavior working.",
    "Do not implement exports (CSV/PDF) or external integrations for revenue reporting."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}