{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enlarge Dashboard TaskDetailDialog modal responsively",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Increase TaskDetailDialog modal width/height on desktop while keeping it responsive on smaller screens and ensuring the task table scrolls without clipping key columns.",
      "acceptanceCriteria": [
        "When opening the Dashboard summary card dialog titled \"All Categories\" (Dashboard > Categories card), the dialog content area is noticeably larger than before (wider and taller) on desktop screens.",
        "The dialog remains responsive on small screens (e.g., uses viewport-relative sizing and does not overflow the viewport).",
        "The task list content remains usable at the larger size: the table area scrolls (vertically and, if needed, horizontally) without clipping important columns (e.g., Assignee, Captain, Actions).",
        "No changes are made to read-only Shadcn UI component sources under frontend/src/components/ui; sizing is applied via composition (e.g., DialogContent className) in app components such as frontend/src/components/TaskDetailDialog.tsx."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskDetailDialog.tsx",
          "operation": "modify",
          "description": "Adjust DialogContent sizing via composition (className overrides) to use a larger, viewport-relative width/height on desktop (e.g., near-full viewport) while remaining constrained on small screens; convert the dialog interior layout to a flex column so the tab content can grow and scroll correctly; update ScrollArea usage to fill remaining height and allow the task list area to scroll vertically; wrap the task Table in an overflow-x container (and/or ensure the ScrollArea supports horizontal overflow) so columns like Assignee/Captain/Actions remain accessible without clipping. Do not modify any files under frontend/src/components/ui."
        }
      ]
    }
  ]
}