{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix production actor initialization canister ID mismatch and improve load diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure frontend actor initialization always targets the currently deployed backend canister ID in production and avoids stale/hardcoded IDs.",
      "acceptanceCriteria": [
        "After deploying, the app no longer lands on the 'Unable to Load' screen due to actor creation failures when opened in production.",
        "The frontend actor is created successfully and initialization proceeds to profile/admin queries without throwing a canister-routing error (e.g., 'canister not found', 'missing canister', route to wrong canister).",
        "If the project supports a generated declarations import for the backend canister, the frontend is confirmed to be using the latest generated canister ID (not a hardcoded/stale value)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Audit and fix actor creation to resolve the backend canister target at runtime (default deployed ID vs override), and pass the resolved canister target into actor creation so production does not rely on stale/mismatched IDs."
        },
        {
          "path": "frontend/src/hooks/useSafeActor.ts",
          "operation": "modify",
          "description": "Ensure actor recreation/retry logic fully re-runs canister target resolution (not cached to a stale canister ID) when reconnecting and when identity changes."
        },
        {
          "path": "frontend/src/components/AppBootstrap.tsx",
          "operation": "modify",
          "description": "Confirm actor-failure handling remains focused on connectivity issues (no unrelated feature changes) and that recovery actions trigger a clean actor re-init path after deploy."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Respect user-configurable backend canister override (backendCanisterId) and ensure Reset Connection Settings fully clears it and restores defaults.",
      "acceptanceCriteria": [
        "When `backendCanisterId` is set (URL/hash or sessionStorage), actor creation uses that value; when it is not set, actor creation uses the default deployed canister ID.",
        "Using the existing 'Reset Connection Settings' action clears `backendCanisterId` from sessionStorage (along with other initialization parameters) and reloads cleanly.",
        "The error screen continues to show English-only user-facing text and does not expose secrets (e.g., tokens) in UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add/verify a single source of truth for connection-related persisted parameters: read `backendCanisterId` from URL/session (URL takes precedence), and implement/verify `clearAllInitializationParameters()` clears `backendCanisterId` and other initialization parameters used by bootstrapping."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Update actor creation to actually consume the resolved `backendCanisterId` override (if present) and fall back to the default deployed backend canister ID when absent; ensure the override is not accidentally ignored during authenticated/anonymous actor creation."
        },
        {
          "path": "frontend/src/components/AppLoadErrorScreen.tsx",
          "operation": "modify",
          "description": "Verify the existing 'Reset Connection Settings' action remains English-only and does not display any secret values; keep copy aligned with connectivity-only recovery."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve connection diagnostics for actor creation failures by logging redacted connection metadata that distinguishes canister ID mismatch vs network/unavailable backend.",
      "acceptanceCriteria": [
        "On actor creation failure, console diagnostics include a clear, redacted hint about the resolved backend canister target (e.g., 'using default ID' vs 'using override') without printing raw tokens.",
        "No secrets (e.g., `caffeineAdminToken`) appear in console output due to diagnostics logging."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/diagnostics.ts",
          "operation": "modify",
          "description": "Extend diagnostics helpers to support structured, redacted logging for actor creation failures, including (a) whether the backend target came from default vs override and (b) a safely redacted canister identifier and basic network context; ensure redaction explicitly prevents leaking `caffeineAdminToken`."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Wrap actor creation and access-control initialization with failure diagnostics that emit the redacted connection metadata (default vs override, redacted canister target) on failure, without logging any secret parameters or identity details."
        }
      ]
    }
  ]
}